Reports/statistics.json
{
  "Place Order" : {
    "transaction" : "Place Order",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 372.1999999999998,
    "medianResTime" : 353.5,
    "minResTime" : 296.0,
    "maxResTime" : 790.0,
    "pct1ResTime" : 447.0,
    "pct2ResTime" : 501.7,
    "pct3ResTime" : 790.0,
    "throughput" : 2.188662727073758,
    "receivedKBytesPerSec" : 0.4402973845480412,
    "sentKBytesPerSec" : 0.4638939045743051
  },
  "Homepage" : {
    "transaction" : "Homepage",
    "sampleCount" : 50,
    "errorCount" : 2,
    "errorPct" : 4.0,
    "meanResTime" : 273.74,
    "medianResTime" : 249.0,
    "minResTime" : 88.0,
    "maxResTime" : 846.0,
    "pct1ResTime" : 579.4999999999999,
    "pct2ResTime" : 720.9499999999995,
    "pct3ResTime" : 846.0,
    "throughput" : 2.252962645879331,
    "receivedKBytesPerSec" : 19.825587248794665,
    "sentKBytesPerSec" : 0.3608260487541116
  },
  "Purchase" : {
    "transaction" : "Purchase",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2206.8,
    "medianResTime" : 1848.0,
    "minResTime" : 1592.0,
    "maxResTime" : 4705.0,
    "pct1ResTime" : 4118.599999999999,
    "pct2ResTime" : 4459.699999999999,
    "pct3ResTime" : 4705.0,
    "throughput" : 2.1732516190724565,
    "receivedKBytesPerSec" : 8.840295209066806,
    "sentKBytesPerSec" : 2.396179695310123
  },
  "Add to Cart" : {
    "transaction" : "Add to Cart",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 377.76000000000005,
    "medianResTime" : 354.5,
    "minResTime" : 312.0,
    "maxResTime" : 981.0,
    "pct1ResTime" : 448.0,
    "pct2ResTime" : 476.45,
    "pct3ResTime" : 981.0,
    "throughput" : 2.4424796052952957,
    "receivedKBytesPerSec" : 0.4698910959405989,
    "sentKBytesPerSec" : 0.7155701968638561
  },
  "Product List" : {
    "transaction" : "Product List",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 731.0800000000002,
    "medianResTime" : 367.5,
    "minResTime" : 314.0,
    "maxResTime" : 3083.0,
    "pct1ResTime" : 2667.0999999999995,
    "pct2ResTime" : 2979.7,
    "pct3ResTime" : 3083.0,
    "throughput" : 2.2356360384529395,
    "receivedKBytesPerSec" : 6.39907151240778,
    "sentKBytesPerSec" : 0.37333375251509054
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 350,
    "errorCount" : 2,
    "errorPct" : 0.5714286,
    "meanResTime" : 530.3771428571432,
    "medianResTime" : 356.5,
    "minResTime" : 88.0,
    "maxResTime" : 3232.0,
    "pct1ResTime" : 651.2000000000006,
    "pct2ResTime" : 2471.1,
    "pct3ResTime" : 3071.78,
    "throughput" : 9.512420503342936,
    "receivedKBytesPerSec" : 17.818775437231615,
    "sentKBytesPerSec" : 2.0381104086264066
  },
  "View Cart" : {
    "transaction" : "View Cart",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 372.3800000000001,
    "medianResTime" : 365.0,
    "minResTime" : 309.0,
    "maxResTime" : 535.0,
    "pct1ResTime" : 446.0,
    "pct2ResTime" : 473.6999999999998,
    "pct3ResTime" : 535.0,
    "throughput" : 2.3213705371651425,
    "receivedKBytesPerSec" : 0.6469913586981754,
    "sentKBytesPerSec" : 0.5486051464784809
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 50,
    "errorCount" : 2,
    "errorPct" : 4.0,
    "meanResTime" : 1505.88,
    "medianResTime" : 896.0,
    "minResTime" : 410.0,
    "maxResTime" : 3512.0,
    "pct1ResTime" : 3304.5,
    "pct2ResTime" : 3443.2999999999997,
    "pct3ResTime" : 3512.0,
    "throughput" : 2.192886276917679,
    "receivedKBytesPerSec" : 19.834013927568968,
    "sentKBytesPerSec" : 0.8710726777334328
  },
  "Product Details" : {
    "transaction" : "Product Details",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 353.3799999999998,
    "medianResTime" : 333.0,
    "minResTime" : 292.0,
    "maxResTime" : 549.0,
    "pct1ResTime" : 446.59999999999997,
    "pct2ResTime" : 499.44999999999976,
    "pct3ResTime" : 549.0,
    "throughput" : 2.557544757033248,
    "receivedKBytesPerSec" : 1.3636908567774935,
    "sentKBytesPerSec" : 0.49702285805626595
  },
  "Authenticate User" : {
    "transaction" : "Authenticate User",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1232.1,
    "medianResTime" : 562.5,
    "minResTime" : 315.0,
    "maxResTime" : 3232.0,
    "pct1ResTime" : 2994.7,
    "pct2ResTime" : 3105.5499999999997,
    "pct3ResTime" : 3232.0,
    "throughput" : 2.2897966660560543,
    "receivedKBytesPerSec" : 0.5608212928191977,
    "sentKBytesPerSec" : 0.542842811183367
  }
}